#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-d27rejx4couw5als]
aws_vpc.this: Refreshing state... [id=vpc-0a4672ac46effdfa1]
aws_kms_key.custom_kms_key: Refreshing state... [id=bb68b1d6-c32e-4451-806a-921461e4e9fb]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_kms_alias.key: Refreshing state... [id=alias/app-weather]
aws_cloudwatch_log_group.service_connect_logs: Refreshing state... [id=/amazon-ecs/app-weather/service-connect]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-weather/log]
aws_ecr_repository.web_container: Refreshing state... [id=app-weather-web]
aws_ecr_repository.api_container: Refreshing state... [id=app-weather-api]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=bb68b1d6-c32e-4451-806a-921461e4e9fb]
aws_secretsmanager_secret.ecs_secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:ecs_secret_app-weather-EXHwy4]
aws_secretsmanager_secret_version.ecs_secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:ecs_secret_app-weather-EXHwy4|terraform-20241214174209074600000003]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-weather]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0be1c340918133b77]
aws_default_security_group.default: Refreshing state... [id=sg-041395efa4445e9f5]
aws_subnet.public[0]: Refreshing state... [id=subnet-0830e0ca62080c581]
aws_route_table.this_rt: Refreshing state... [id=rtb-02bbf5901ddb3f50e]
aws_subnet.public[1]: Refreshing state... [id=subnet-08ee0b91a5f9d6900]
aws_route_table.private[1]: Refreshing state... [id=rtb-0226450bec4f521d7]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-04766720d62b46561]
aws_route_table.private[0]: Refreshing state... [id=rtb-091d82566a12c3080]
aws_security_group.container_sg: Refreshing state... [id=sg-0da63b35d4eabecee]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-weather/67c536ad15161de8]
aws_security_group.custom_sg: Refreshing state... [id=sg-0211a272c0b41a2fd]
aws_subnet.private[0]: Refreshing state... [id=subnet-097abde68839a78a7]
aws_subnet.private[1]: Refreshing state... [id=subnet-0d4a6bb23a2bdedfd]
aws_security_group.endpoint_sg: Refreshing state... [id=sg-0f908ca23a7508b36]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-02343ba257aeadc20]
aws_eip.nat[1]: Refreshing state... [id=eipalloc-075cfa0b70ae74ce9]
aws_route.internet_route: Refreshing state... [id=r-rtb-02bbf5901ddb3f50e1080289494]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-2321667585]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-3636111681]
aws_security_group_rule.egress_container: Refreshing state... [id=sgrule-3097792632]
aws_security_group_rule.ingress_container: Refreshing state... [id=sgrule-817931993]
aws_security_group_rule.ingress_api_container: Refreshing state... [id=sgrule-1069668111]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-weather/c2ecf69bbae2469c]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b20ad66656ae918b]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-086dd3b631d809273]
aws_security_group_rule.ingress_vpc_endpoint: Refreshing state... [id=sgrule-3888207563]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-09bf67ac5b6226a32]
aws_vpc_endpoint.ecr: Refreshing state... [id=vpce-0df60e6d9762489ac]
aws_vpc_endpoint.secrets_manager: Refreshing state... [id=vpce-02c479eb5f4b2fb4d]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02ae5c13ce77faccc]
aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0afa5b8c39584c3c2]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0492d668dd271c570]
aws_vpc_endpoint_route_table_association.s3_association[0]: Refreshing state... [id=a-vpce-04766720d62b465614263435813]
aws_vpc_endpoint_route_table_association.s3_association[1]: Refreshing state... [id=a-vpce-04766720d62b46561382592415]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-098a71c7b9aa731c2]
aws_nat_gateway.this[1]: Refreshing state... [id=nat-0816c074bfb3d1746]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-weather/c2ecf69bbae2469c/97cd0476847139b5]
aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0226450bec4f521d71080289494]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-091d82566a12c30801080289494]
aws_ssm_parameter.infra_output: Refreshing state... [id=/app-weather/output]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group_rule.ingress_api_container will be created
  + resource "aws_security_group_rule" "ingress_api_container" {
      + cidr_blocks              = [
          + "11.90.30.0/25",
        ]
      + description              = "allow traffic into the API containers from the vpc"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0da63b35d4eabecee"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*